("what is the total amount of Third class passengers that were on board the Titanic?")

("The type of data that I am collecting is a census. I want the total amount of people on the Titanic that are bellow first class. It makes the answer more representative of what is being collected.") Bias will happen when I am trying to get data that will only separate the third class passengers from the first class passengers. Bias is hard to avoid in data collection.

In [21]:
import pandas as pd

df = pd.read_csv("titanic.csv")

In [22]:
seventh = df.iloc[6]

In [24]:
df2 = df[df["Pclass"] == 2]

In [28]:
df2_3 = df[(df["Pclass"] == 2) | (df["Pclass"] == 3)]

In [31]:
df2_3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S